---
kind: property
id: P:Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs.FullDownload
source: html/103ccd84-2094-1dfe-c7b5-19d0c314045a.htm
---
# Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs.FullDownload Property

Indicates if download the full data of the document, which will take longer than subsequent downloads.

## Syntax (C#)
```csharp
public bool FullDownload { get; }
```